v1/app/Controllers/Form.php

    public function index($etapa='01', $subetapa = '01')
    {
        $gr1 = round($etapa);
        $gr2 = round($subetapa);

        $placeModel = new PlaceModel();
        $QuestionGroup = new \App\Models\QuestionGroupModel();
        $BancoImagens = new \App\Models\BancoImagensModel();
        $Question = new \App\Models\QuestionGroupModel();

        $anonId = getAnonymousSessionId();

        $placeData = $placeModel->where('pl_anon_id', $anonId)->first();

        /********************************* Grupo de Questões */
        $groupHeader = $Question->where('gr_class', $etapa . '.00.00.0')->first();
        $group = $Question->where('gr_class', $etapa.'.'.$subetapa.'.00.0')->first();
---
SELECT *
FROM `places`
WHERE `pl_anon_id` = '801321020c804bc2d8edf8e7b3411df0'
 LIMIT 1
SELECT *
FROM `question_group`
WHERE `gr_class` = '07.00.00.0'
 LIMIT 1
SELECT *
FROM `question_group`
WHERE `gr_class` = '07.01.00.0'
 LIMIT 1