v1/app/Models/BancoImagensModel.php

    function getImage($img_id)
    {
        $dt = $this->where('id_img', $img_id)->first();
---
SELECT *
FROM `banco_imagens`
WHERE `id_img` = '07.00.00.0'
 LIMIT 1