v1/app/Controllers/Api/Users.php

SELECT *
FROM `users`
WHERE `us_email` = 'renefgj@gmail.com'
 LIMIT 1
---
    function exist()
    {
        $RSP = [];
        $model = new UserModel();
        $email = get('email');
        $dt = $model->where('us_email', $email)->first();

SELECT *
FROM `users`
WHERE `us_email` = 'renefgj@gmail.com'
AND `us_code` = '243572'
 LIMIT 1
UPDATE `users` SET `updated_at` = '2025-09-06 18:52:24'
WHERE `users`.`id_us` IN ('5')
---
    function validateUser()
    {
        $RSP = [];
        $model = new UserModel();
        $email = get('email');
        $code = get('code');
        $dt = $model->where('us_email', $email)->where('us_code', $code)->first();
        if ($dt) {
            $RSP['status'] = '200';
            $RSP['validate'] = true;
            $RSP['message'] = 'Usuário validado com sucesso.';
            $data = [
                'us_validate' => 1,
                'updated_at' => date('Y-m-d H:i:s'),
            ];
            $model->update($dt['id_us'], $data);